/*

    Створити клас-функтор Sum, який рахує
    суму позитивних чисел, якщо наявне хоча б
    одне від'ємне число, повертаємо -1. Зробити
    функцію з групою тестів. Тести проводити за 
    допомогою макроса assert.

    Створити клас-функтор Sort, який сортує масив.
    Перевантажений оператор круглих дужок зробити
    шаблоном. Параметрами перевантаженого
    оператору є:
    - покажчик на масив;
    - розмір масиву;
    - предикат.
    Створити функцію з тестом для масиву. У функції
    оголосити три масиви:
    - випадково заповнений;
    - відсортований за зростанням;
    - відсортований за спаданням.
    Відсортувати масив за зростанням/спаданням і
    порівняти з початковими масивами(assert).

*/

#include <Windows.h>
#include "SortArray.h"
#include "Sum.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    testingSort();
    testingSum();
}