/*

    Створити клас Number з полем значення(int).
    Методи класу:
    - конструктор з параметром;
    - конструктор копіювання;
    - функції доступу до поля класу;
    - функція розрахунку факторіалу числа,
    передбачити виключення для переповнення.
    Перевантаження:
    - оператора присвоювання;
    - оператора(*), виключення для множення на 0 та 1;
    - оператора(+);
    - оператор(/), передбачити виключення для
    ділення на 0.
    Усі винятки обробляти за допомогою assert.

*/

#include <Windows.h>
#include "Number.h"
using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    Number number(5);

    //Арифметичні перетворення
    number = number + 5;
    number = number * 2;
    number = number / 4;

    cout << "Значення: " << number.getValue();
    cout << "\nФакторіал числа: " << number.getFactorial() << endl;

    //Змінюємо значення на 15
    number.setValue(15);

    //Помилка, після числа 12 відбувається переповнення int
    cout << "\nФакторіал числа: " << number.getFactorial();
}