/*

    Створити клас Doctor, у якого поле ім'я пацієнта.
    Методи класу:
    - перевірка, чи прикріплений пацієнт.
    Перевантаження(через дружні фукції):
    - оператор(>>), перевіряє чи прикріплений
    пацієнт до доктора, так - не змінюємо ім'я,
    ні - прикріплюємо нове;
    - оператор(<<), друкує ім'я паціента;
    - постфіксний декремент, який очіщає поле пацієнта.

*/

#include "Doctor.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    
    Doctor doctor;

    cout << " --- Оператори(>>, <<) ---\n";
    cout << "Введіть ім'я пацієнта: ";
    cin >> doctor;
    cout << doctor;

    cout << " --- Перевірка на наявність пацієнта ---\n";
    if (doctor.hasPatient()) {
        cout << "\nПацієнт вже наявний" << endl;
    }

    cout << " --- Перевантаження декремента ---\n";
    doctor--;
    cout << "\nВведіть ім'я іншого пацієнта: ";
    cin >> doctor;
    cout << doctor;
}