/*

    Створити клас Circle, полем якого є радіус.
    Методи класу:
    - "гетер" для поля класу;
    - функція підрахунку площини;
    - функція підрахунку довжини окружності.
    Перевантаження(через дружні функції):
    - оператор(+) збільшення радіусу (int);
    - оператор(<<), який друкує радіус;
    - оператор(>>) змінює значення радіусу;
    - оператор присвоєння(через метод класу).

*/

#include "Circle.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    Circle circle;

    cout << "Введіть радіус круга: ";
    cin >> circle;
    cout << "Радіус = " << circle << endl;

    cout << "Площа круга = " << circle.areaCalc() << endl;
    cout << "Довжина окружності = "
        << circle.circumferenceCalc() << "\n\n";

    //Додавання до довжини радіусу
    circle = circle + 6;
    cout << "Новий радіус = " << circle << endl;

    cout << "Нова площа круга = " << circle.areaCalc() << endl;
    cout << "Нова довжина окружності = "
        << circle.circumferenceCalc() << endl;
}


