/*

    Створити клас City, поля якого:
    - назва міста;
    - кількість населення.
    Методи класу:
    - конструктор з параметрами за замовчуванням;
    - конструктор копіювання.
    Перевантаження: 
    - перевантаження оператора(<<);
    - перевантаження оператора(<), який порівнює
    назви міст;
    - перевантаження оператора круглих дужок(функтор),
    для порівняння кількості населення.

    Створити vector з типом City, заповнити його різними
    містами. За допомогою вбудованого sort спочатку звичайно
    відсортувати вектор, роздрукувати його. Повторно
    відсортувати за допомогою вбудованого функтора в клас City,
    роздрукувати.

*/

#include <Windows.h>
#include <algorithm>
#include <vector>
#include "City.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    vector<City> cities = {City("Харків", 1420000),
                           City("Запоріжжя", 710000),
                           City("Київ", 2890000),
                           City("Львів", 731000)};

    cout << " --- Друк інформації про міста ---\n";
    for (auto& city : cities) {
        cout << city << endl;
    }

    //Сортування vector за допомогою 
    //перевантаженого operator<
    sort(cities.begin(), cities.end());

    cout << "\n--- Сортування за допомогою operator< ---\n";
    for (const auto& city : cities) {
        cout << city << endl;
    }

    //Сортування vector за допомогою функтора
    //реалізованого у класі City
    sort(cities.begin(), cities.end(), City());

    cout << "\n--- Сортування за допомогою функтора ---\n";
    for (const auto& city : cities) {
        cout << city << endl;
    }
}