/*

	Створити клас Animal з полями:
	- назва тварини;
	- вага.
	Методи класу:
	- конструктор з параметрами за замовчуванням;
	- конструктор копіювання;
	- група гетерів класу.
	У класі наявне перевантаження оператора(<<).

	Створити клас Zoo з полями:
	- змінна, яка контролює тип додавання і сортування(flag);
	- список тварин(list).
	Методи класу:
	- конструктор за замовчуванням;
	- сетер для поля flag;
	- функція додавання тварини, якщо flag
	дорівнює 0, додаємо на початок списку,
	в іншому випадку додаємо в кінець списку;
	- функція пошуку тварини, реалізувати за допомогою
	функції for_each та лямбда-виразу;
	- сортування списку тварин, якщо flag дорівнює 1, 
	сортуємо за назвою, в іншому випадку за вагою.

*/

#include <Windows.h>
#include "Zoo.h"

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	Zoo zoo;

	//Зміна флагу
	zoo.setFlag(1);

	//Додавання тварин у кінець списку
	zoo.addAnimal(Animal("Тигр", 150));
	zoo.addAnimal(Animal("Лев", 190));
	zoo.addAnimal(Animal("Зебра", 280));
	zoo.addAnimal(Animal("Слон", 3000));
	
	cout << "--- Друк інформації ---\n";
	zoo.printInfo();

	//Зміна флагу
	zoo.setFlag(0);

	//Сортування за вагою тварини
	zoo.sortList();

	cout << "\n\n--- Відсортований список ---\n";
	zoo.printInfo();

	if (zoo.findAnimal("Зебра")) {
		cout << "\nТварина знайдена!\n";
	}
	else {
		cout << "\nТварина не знайдена!\n";
	}
}