/*

    Створити клас ArrayCombination, який комбінує
    два масиви з файлів в один результуючий. 
    Створення масиву із двох відбувається за правилами:
    - знаходимо розмір масивів у двох файлах;
    - створюємо результуючий масив розміром, як сума
    розмірів двох масивів з файлів;
    - по черзі беремо число з кожного файлу і записуємо 
    у масив.
    Поля класу:
    - покажчик на результуючий масив;
    - розмір масиву;
    - шлях до файлів.
    Методи класу:
    - конструктор з параметрами(шлях до файлів);
    - деструктор;
    - функція розрахунку розміру масиву у файлі;
    - функція для комбінації масивів;
    - друк масиву.

*/

#include <Windows.h>
#include "ArrayCombination.h"

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    //Шлях до файлів
    string firstPath = "firstArray.txt";
    string secondPath = "secondArray.txt";

    //Об'єкт класу ArrayCombination
    ArrayCombination array(firstPath, secondPath);
 
    //Комбінація двох масивів з файлів у один масив
    array.combination();

    //Друк масиву на екран
    cout << "Результуючий масив: ";
    array.printArray();
}