/*

	Створити клас Notes, який частково імітує 
	роботу однойменного додатку. Поля класу:
	- пароль;
	- прапор входу до облікового запису(bool);
	- нотатки(map<int, string>).
	Методи класу:
	- конструктор з параметром(пароль);
	- функція входу до облікового запису, якщо
	паролі збігаються, змінюємо прапор;
	- функція виходу з облікового запису;
	- функція зміни паролю(кількість символів більше 7);
	- функція додавання нотатку, де ключ номер нотатки,
	а значення текст нотатки;
	- функція заміни тексту в нотатці, користувач вводить
	номер нотатки, текст, індекс початку заміни, кількість
	символів для заміни(replace);
	- функція друку нотаток.
	Передбачити ситуацію, якщо користувач не ввійшов в акаунт,
	він не може користуватися нотатками. 

*/

#include <Windows.h>
#include "Notes.h"

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	string myPassword = "12adfG521";
	Notes account(myPassword);

	try
	{
		cout << "Введіть пароль: ";
		cin >> myPassword;
		account.login(myPassword);

		//Додавання нотаток
		account.addNote("Тренування 16:00, взяти форму");
		account.addNote("Купити продукти");
		account.addNote("Замовити подарунок");

		//Зміна часу у першій замітці
		account.changeNote(1, "17:00", 11, 5);

		cout << "Зміна паролю(кількість символів > 7): ";
		cin >> myPassword;
		account.setPassword(myPassword);

		//Друк нотаток
		account.printNotes();
		
		//Вихід з облікового запису
		account.exit();
	}
	catch (const exception& exception)
	{
		cout << exception.what() << endl;
	}
}