/*

	Створити макрос assert з параметрами:
	- умова;
	- повідомлення про помилку.
	Якщо умова хибна, друкувати повідомлення та
	за допомогою std::abort() завершити роботу програми.

	Створити клас-функтор StringTester. Перевантажити
	оператор круглих дужок для тесту рядка(char*).
	Реалізувати тести:
	- рядок не вказує на NULL;
	- рядок не є порожнім;
	- довжина рядка більша за 0.

	Створити клас Ticket з полями:
	- повне ім'я(char*);
	- номер рейсу.
	Методи класу:
	- конструктор з параметрами(ім'я, прізвище, номер);
	- деструктор.
	Перевантажити оператор(<<). У конструкторі перевіряти
	на коректність ім'я та прізвище.

*/

#include <Windows.h>
#include "Ticket.h"

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	Ticket firstTicket("Денис", "Паржницький", 15);
	cout << " --- Перший квиток ---\n";
	cout << firstTicket << endl;

	Ticket secondTicket("", "Пишкін", 21);
	cout << " --- Другий квиток ---\n";
	cout << secondTicket << endl;
}